[options]
mode bmc
depth 20
expect pass,fail

[engines]
abc bmc3

[script]
read_verilog -sv test_eq.sv
read_ilang mutated.il
prep -top miter
fmcombine miter ref uut
flatten
opt -fast

[files]
test_eq.sv
mutated.il
